#### Terraform Plan 📖

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # null_resource.simple_test will be created
  + resource "null_resource" "simple_test" {
      + id       = (known after apply)
      + triggers = {
          + "app_name" = "my-test-app"
          + "suffix"   = (known after apply)
        }
    }

  # random_string.app_suffix will be created
  + resource "random_string" "app_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_instance_id = (known after apply)
  + app_name        = "my-test-app"
  + environment     = "dev"
  + random_suffix   = (known after apply)

```

*Pusher: @alexg84, Action: `pull_request`*
